/*********************************************************************************************************
* 模块名称：DAC.c
* 摘    要：DAC模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DAC.h"
#include "stm32f10x_conf.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define DAC_DHR12R1_ADDR    ((u32)0x40007408)   //DAC1的地址（12位右对齐）
#define DAC_DHR12R2_ADDR    ((u32)0x40007414)   //DAC1的地址（12位右对齐）

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void ConfigDAC1(void);                          //配置DAC1
                                          
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigTimer4
* 函数功能：配置TIM4
* 输入参数：arr-自动重装值，psc-预分频器值
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：DAC每两个点之间的时间差为(arr+1)*(psc+1)/72(us)，100个点，周期即为1ms
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称：ConfigDAC1
* 函数功能：配置DAC1，DAC1通过PA4输出
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：为避免寄生干扰和额外功耗，GPIO模式建议设置为模拟输入
*********************************************************************************************************/
static  void ConfigDAC1(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure; //GPIO_InitStructure用于存放GPIO的参数
  DAC_InitTypeDef   DAC_InitStructure;  //DAC_InitStructure用于存放DAC的参数

  //使能RCC相关时钟
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);  //使能GPIOA的时钟
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);    //使能DAC的时钟
  
  //配置DAC1的GPIO
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_4;            //设置引脚
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;      //设置I/O输出速度
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AIN;         //设置输入类型
  GPIO_Init(GPIOA, &GPIO_InitStructure);                 //根据参数初始化GPIO
  
  //配置DAC1
  DAC_InitStructure.DAC_Trigger = DAC_Trigger_Software;           //设置DAC触发（软件触发）
  DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None; //关闭波形发生器
  DAC_InitStructure.DAC_LFSRUnmask_TriangleAmplitude = DAC_LFSRUnmask_Bit0; //不屏蔽LSFR位0
  DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable;   //使能DAC输出缓存
  DAC_Init(DAC_Channel_1, &DAC_InitStructure);    //初始化DAC通道1

  DAC_SetChannel1Data(DAC_Align_12b_R, 0);        //设置为12位右对齐数据格式和初始值
  
  DAC_Cmd(DAC_Channel_1, ENABLE);                 //使能DAC通道1
}

/*********************************************************************************************************
* 函数名称：ConfigDMA2Ch3ForDAC1
* 函数功能：配置DMA2通道3
* 输入参数：wave，包括波形地址和点数
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称：DMA2_Channel3_IRQHandler
* 函数功能：DMA2_Channel3的中断服务函数
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitDAC
* 函数功能：初始化DAC模块 
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void InitDAC(void)
{              
  ConfigDAC1(); //配置DAC1
}

/*********************************************************************************************************
* 函数名称：SetDACWave
* 函数功能：设置DAC波形属性 
* 输入参数：wave，包括波形地址和点数
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void SPO2_SetDAC(int dacValue)
{
//设置DAC数据（12位右对齐）
  DAC_SetChannel1Data(DAC_Align_12b_R, dacValue);
  //软件触发更新输出
  DAC_SoftwareTriggerCmd(DAC_Channel_1, ENABLE);
}
