/*********************************************************************************************************
* 模块名称: XXX.c
* 摘    要: 模块实现具体功能
* 当前版本: 1.0.0
* 作    者: XXX
* 完成日期: 2024年12月14日
* 内    容:
* 注    意:
**********************************************************************************************************
* 取代版本:
* 作    者:
* 完成日期:
* 修改内容:
* 修改文件:
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "Filter.h"
#include "DataType.h"
#include "UART1.h"
#include "math.h"

#include "50HzIIRFilter.h"
#include "100HzIIRFilter.h"
#include "200HzIIRFilter.h"
#include "LowerIIRFilter3.h"

#include "arm_math.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
RESP_Filter_Smooth respFilter;
/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
u8 RESP_Filter_Flag='1';    //默认有滤波

//切比雪夫滤波器[0.5-high]
static arm_biquad_casd_df1_inst_f32 RESP_Filter_butterworth_inst;
const uint8_t RESP_Filter_butterworth_STAGES = 1;
static float32_t RESP_Filter_butterworth_state[RESP_Filter_butterworth_STAGES * 4] = {0};// 3. 状态缓存数组（参数4：pState）：2级 × 4 = 8个元素，初始化为0
const float32_t RESP_Filter_butterworth_Coeffs[5 * RESP_Filter_butterworth_STAGES] = {  // 2级滤波器，每级5个系数
1 , -1.999980260758728034531372941273730248213 , 1 , 1.93749365972692122461751296214060857892 , -0.939406846029880115978016874578315764666
};
//增益
static float  RESP_Filter_butterworth_NotchInc = 
0.96922990940495779010888099946896545589  ;      

//切比雪夫滤波器[low-15]
static arm_biquad_casd_df1_inst_f32 RESP_Filter_chebyshev_ii_inst;
const uint8_t RESP_Filter_chebyshev_ii_STAGES = 5;
static float32_t RESP_Filter_chebyshev_ii_state[RESP_Filter_chebyshev_ii_STAGES * 4] = {0};// 3. 状态缓存数组（参数4：pState）：2级 × 4 = 8个元素，初始化为0
const float32_t RESP_Filter_chebyshev_ii_Coeffs[5 * RESP_Filter_chebyshev_ii_STAGES] = {  // 2级滤波器，每级5个系数
1 , -1.355816 , 1 , 1.6012297 , -0.8821587,
1 , -1.236562 , 1 , 1.4033081 , -0.6724096,
1 , -0.910095 , 1 , 1.2093896 , -0.4823843,
1 , -0.095811 , 1 , 1.0364197 , -0.3207304,
1 , 1.5376899 , 1 , 0.9283247 , -0.2220609
};
//增益
static float  RESP_Filter_chebyshev_ii_NotchInc = 
0.43610078046   *                                                                                             
0.35248652973   *                                                                                            
0.25047572054   *                                                                                             
0.14930800248   *                                                                                             
0.08303050509   ;     
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
void RESP_Filter_IIR(float* x);               //滤波
double  IIRFilterc(const double* b, const double* a, int n, int ns, double* px, double* py, double x);
void BaselineFilterTask(float *dataAddr);                  
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: RESP_Filter_IIR
* 函数功能: 呼吸IIR滤波
* 输入参数: double* x ：输入数据的地址
            int N ：数据个数
* 输出参数: void
* 返 回 值: void
* 创建日期: 2025年11月26日
* 注    意:
*********************************************************************************************************/
void RESP_Filter_IIR(float* x)
{
  
    arm_biquad_cascade_df1_f32
  (
      &RESP_Filter_chebyshev_ii_inst,  // S：已初始化的实例
      x,                              // pIn：输入数据
      x,                              // pOut：输出数据
      1                               // blockSize：单次处理32点
  );
  (*x) *= RESP_Filter_chebyshev_ii_NotchInc;

  BaselineFilterTask(x);
//    arm_biquad_cascade_df1_f32
//  (
//      &RESP_Filter_butterworth_inst,  // S：已初始化的实例
//      x,                              // pIn：输入数据
//      x,                              // pOut：输出数据
//      1                               // blockSize：单次处理32点
//  );

//  (*x) *= RESP_Filter_butterworth_NotchInc;
}

/*********************************************************************************************************
* 函数名称： IIRFilterc
* 函数功能： 级联型 IIR 数字滤波器
* 输入参数： b  ：双精度实型二维数组，体积为 ns*（n+1）。存放滤波器分子多项式的系数，
*                 b[j][i] 表示第 j 个 n 阶节的分子多项式的第 i 个系数。
*            a  ：双精度实型二维数组，体积为 ns*（n+1）。存放滤波器分母多项式的系数，
*                 a[j][i] 表示第 j 个 n 阶节的分母多项式的第 i 个系数。
*            n  ：整型变量。级联型滤波器每节的阶数。
*            ns ：整形变量。级联型滤波器的 n 阶节数 L。
*            px ：双精度实型二维数组，体积为 ns*（n+1）。存放历史输入数据，初始状态必须为零。
*            py ：双精度实型二维数组，体积为 ns*（n+1）。存放历史输入数据，初始状态必须为零。
*            x  ：双精度实型变量。新的采样值；
* 输出参数： void
* 返 回 值： 滤波后的采样值
* 创建日期： 2023年10月10日
* 注    意：
*********************************************************************************************************/
double  IIRFilterc(const double* b, const double* a, int n, int ns, double* px, double* py, double x)
{
  int i, j, n1;
  n1 = n + 1;
  for (j = 0; j < ns; j++)
  {
    px[j * n1 + 0] = x;
    x = b[j * n1 + 0] * px[j * n1 + 0];
    for (i = 1; i <= n; i++)
    {
      x += b[j * n1 + i] * px[j * n1 + i] - a[j * n1 + i] * py[j * n1 + i];
    }
    for (i = n; i >= 2; i--)
    {
      px[j * n1 + i] = px[j * n1 + i - 1];
      py[j * n1 + i] = py[j * n1 + i - 1];
    }
    px[j * n1 + 1] = px[j * n1 + 0];
    py[j * n1 + 1] = x;
  }
  return x;
}

/*********************************************************************************************************
* 函数名称：BaselineFilterTask
* 函数功能：滤波器模块任务
* 输入参数：滤波数据的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  采用IIR型滤波器
**********************************************************************************************************/
void BaselineFilterTask(float *dataAddr)                  
{
	static float b1[3],a1[3];  //第一节滤波系数 
	static float b2[3],a2[3];  //第二节滤波系数
  static float bufX[3],bufY[3];   
	
	b1[0]=1;b1[1]=-2;b1[2]=1;          //滤波器分子系数
	a1[0]=1;a1[1]=-1.990271241;a1[2]= 0.99042;      //滤波器分母系数	
	b2[0]=1;b2[1]=-2;b2[2]=1;          //滤波器分子系数
	a2[0]=1;a2[1]=-1.9768913542871;a2[2]= 0.9770474536;      //滤波器分母系数
  
	bufX[0] = *dataAddr;
	
	bufY[0] = -a1[1]*bufY[1]-a1[2]*bufY[2]+bufX[0]+b1[1]*bufX[1]+bufX[2];//第一节
	
	bufY[0] = -a2[1]*bufY[1]-a2[2]*bufY[2]+bufX[0]+b2[1]*bufX[1]+bufX[2];//第二节
	
	bufY[2]=bufY[1];bufY[1]=bufY[0];
	bufX[2]=bufX[1];bufX[1]=bufX[0];
	
	*dataAddr = bufY[0];
}
/*********************************************************************************************************
* 函数名称：BaselineFilterTask
* 函数功能：滤波器模块任务
* 输入参数：滤波数据的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  采用IIR型滤波器
**********************************************************************************************************/
void RESP_Filter_Smooth_Init(RESP_Filter_Smooth *filter) 
{
  int i = 0;
  for (i = 0; i < EC_SmoothFILTER_WINDOW_SIZE; i++) 
  {
    filter->buffer[i] = 0;
  }
  filter->head = 0;
  filter->sum = 0;
}
/*********************************************************************************************************
* 函数名称：BaselineFilterTask
* 函数功能：滤波器模块任务
* 输入参数：滤波数据的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  采用IIR型滤波器
**********************************************************************************************************/
float Filter_Update(RESP_Filter_Smooth *filter, float newInput) {
    // 1. 从总和中减去最老的一个数据（即将被覆盖的数据）
    filter->sum -= filter->buffer[filter->head];

    // 2. 将新数据存入缓冲区当前位置
    filter->buffer[filter->head] = newInput;

    // 3. 将新数据加入总和
    filter->sum += newInput;

    // 4. 更新索引（环形移动）
    filter->head++;
    if (filter->head >= EC_SmoothFILTER_WINDOW_SIZE) {
        filter->head = 0;
    }

    // 5. 返回平均值 (总和 / 12)
    // 注意：整数除法会丢弃小数部分。如果需要四舍五入，可以写成: (filter->sum + FILTER_WINDOW_SIZE/2) / FILTER_WINDOW_SIZE
    return (filter->sum / EC_SmoothFILTER_WINDOW_SIZE);
}
/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: RESP_Filter
* 函数功能: 呼吸滤波任务主入口
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2025年11月26日
* 注    意:
*********************************************************************************************************/
void RESP_Filter(float* x)
{
  switch(RESP_Filter_Flag)
  {
    case '0':
      break;
    case '1':
      RESP_Filter_IIR(x);
      *x = Filter_Update(&respFilter, *x);
      break;
    default:
      printf("ERROR:滤波器选择错误");
      break;
  }
}
/*********************************************************************************************************
* 函数名称: InitFilter
* 函数功能: 呼吸滤波任务初始化
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2025年11月26日
* 注    意:
*********************************************************************************************************/
void InitFilter()
{
  
  arm_biquad_cascade_df1_init_f32//巴特沃斯
  (
    &RESP_Filter_butterworth_inst,  // S：实例地址
    RESP_Filter_butterworth_STAGES,               // numStages：2级（4阶）
    (float32_t*)&RESP_Filter_butterworth_Coeffs,   // pCoeffs：带通系数
    RESP_Filter_butterworth_state     // pState：状态缓存
  );
  
  RESP_Filter_Smooth_Init(&respFilter);
  
    arm_biquad_cascade_df1_init_f32//切比雪夫II
  (
    &RESP_Filter_chebyshev_ii_inst,  // S：实例地址
    RESP_Filter_chebyshev_ii_STAGES,               // numStages：2级（4阶）
    (float32_t*)&RESP_Filter_chebyshev_ii_Coeffs,   // pCoeffs：带通系数
    RESP_Filter_chebyshev_ii_state     // pState：状态缓存
  );

}
